pmo-dataset/variations/graphviz_with_ids/09.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Discard prototype"];
  "Task_2" [label="Identify idea for\nnew product or\nimprovement"];
  "Task_3" [label="Collect feedback\nfrom testing phase"];
  "Task_4" [label="Test market\npotential"];
  "Task_5" [label="Refine prototype"];
  "Task_6" [label="Test functionality"];
  "Task_7" [label="Approve prototype\nfor further\ndevelopment"];
  "Task_8" [label="Select promising\ndesign"];
  "Task_9" [label="Conduct initial\nresearch"];
  "Task_10" [label="Draft design\nconcepts"];
  "Task_11" [label="Test safety"];
  "Task_12" [label="Conduct feasibility\nstudies"];
  "Task_13" [label="Build prototype"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];

  "StartNoneEvent_1" -> "Task_2";
  "ParallelGateway_1" -> "Task_12";
  "Task_11" -> "ParallelGateway_2";
  "Task_5" -> "ExclusiveGateway_4";
  "Task_7" -> "ExclusiveGateway_2";
  "Task_2" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Task_9";
  "Task_9" -> "ParallelGateway_4";
  "ExclusiveGateway_4" -> "ParallelGateway_3";
  "ExclusiveGateway_3" -> "Task_1";
  "ParallelGateway_3" -> "Task_6";
  "ExclusiveGateway_3" -> "Task_7";
  "Task_12" -> "ParallelGateway_4";
  "ParallelGateway_3" -> "Task_11";
  "ExclusiveGateway_1" -> "Task_5";
  "ExclusiveGateway_1" -> "ExclusiveGateway_3";
  "ParallelGateway_3" -> "Task_4";
  "Task_8" -> "Task_13";
  "Task_13" -> "ExclusiveGateway_4";
  "ExclusiveGateway_2" -> "EndNoneEvent_1";
  "ParallelGateway_4" -> "Task_10";
  "Task_3" -> "ExclusiveGateway_1";
  "ParallelGateway_2" -> "Task_3";
  "Task_10" -> "Task_8";
  "Task_6" -> "ParallelGateway_2";
  "Task_4" -> "ParallelGateway_2";
  "Task_1" -> "ExclusiveGateway_2";
}
